src/InformationRegisters/KFK_ОчередьДействийПослеОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>KFK_ОчередьДействийПослеОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаборЗначений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОбмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.KFK_КлассификаторДействийСОбъектамиОчередиПослеОбмена</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>72</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/KFK_ОчередьДействийПослеОбмена/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗапись(СтруктураПараметров) Экспорт
	Запись = РегистрыСведений.KFK_ОчередьДействийПослеОбмена.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, СтруктураПараметров);	
	
	Если НЕ ЗначениеЗаполнено(Запись.Действие) Тогда
		Запись.Действие = Справочники.KFK_КлассификаторДействийСОбъектамиОчередиПослеОбмена.Проведение;
	КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(Запись.ИдентификаторМетаданных) И ЗначениеЗаполнено(Запись.Объект) Тогда
	//	Запись.ИдентификаторМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(СтруктураПараметров.Объект));
	//КонецЕсли;
	
	Запись.Записать(истина);
КонецПроцедуры

Функция ВыполнитьУдалениеЗаписей(ИдентификаторЗадания, ИдентификаторыОбъектов) Экспорт
	Для каждого ИдентификаторОбъекта Из ИдентификаторыОбъектов Цикл
		НаборЗаписей = РегистрыСведений.KFK_ОчередьДействийПослеОбмена.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторОперации.Установить(ИдентификаторЗадания);
		НаборЗаписей.Отбор.ИдентификаторОбъекта.Установить(ИдентификаторОбъекта);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
	КонецЦикла;
КонецФункции

Функция ПолучитьСтруктуруЗаписи() Экспорт
	Возврат Новый Структура("Объект, Действие, ИдентификаторОперации, 
							|ИдентификаторОбъекта, НаборЗначений, 
							|ДатаОбмена, ДатаОбработки, ИдентификаторМетаданных");
КонецФункции 

#Область ПрограммноеСозданиеКоманд

//Функция ПолучитьОбъектыОбработкиОчереди() Экспорт
//	МассивОбъектов = Новый Массив;
//	Измерения = Метаданные.РегистрыСведений["ВИ_ОчередьДействийПослеОбмена"].Измерения;	
//	Для каждого Тип Из Измерения.Объект.Тип.Типы() Цикл
//		МассивОбъектов.Добавить(ОбщегоНазначения.СтроковоеПредставлениеТипа(Тип));
//	КонецЦикла;
//	
//	Возврат МассивОбъектов;
//КонецФункции

#КонецОбласти //ПрограммноеСозданиеКоманд

#КонецОбласти

#КонецЕсли
